In [2]:
#import numpy as np
import pandas as pd
d={"name":["shah","vats","vats","kumar","vats","kumar","shah","shah","kumar","vats"],
"gender":["male","male","female","female","female","male","male","female","female","male"],
"monthly_income(Rs.)":[114000,65000,43150,69500,155000,103000,55000,112400,81030,71900]}
df=pd.DataFrame(d)
print(df)

    name  gender  monthly_income(Rs.)
0   shah    male               114000
1   vats    male                65000
2   vats  female                43150
3  kumar  female                69500
4   vats  female               155000
5  kumar    male               103000
6   shah    male                55000
7   shah  female               112400
8  kumar  female                81030
9   vats    male                71900

In [3]:
a1=df.groupby('name')['monthly_income(Rs.)'].sum()
a1

name
kumar    253530
shah     281400
vats     335050
Name: monthly_income(Rs.), dtype: int64

In [4]:
a2=df.groupby('name').agg({'monthly_income(Rs.)':['sum','min','max']})
a2

      monthly_income(Rs.)
                      sum    min     max
name
kumar              253530  69500  103000
shah               281400  55000  114000
vats               335050  43150  155000

In [5]:
a3=df.groupby('name').max()
a3

      gender  monthly_income(Rs.)
name
kumar   male               103000
shah    male               114000
vats    male               155000

In [7]:
df4=df['monthly_income(Rs.)']>60000
a4=df[df4]
a4.sort_values('name',inplace=True)
print(a4)

    name  gender  monthly_income(Rs.)
3  kumar  female                69500
5  kumar    male               103000
8  kumar  female                81030
0   shah    male               114000
7   shah  female               112400
1   vats    male                65000
4   vats  female               155000
9   vats    male                71900

C:\Users\pc\AppData\Local\Temp\ipykernel_8352\179489335.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a4.sort_values('name',inplace=True)

In [ ]:
a5=df[df['name']=='shah'][df['gender']=='female'].mean()
a5